GopalSaraf/Practicals/PSDL/include/proc/pic10f222.h
// Register: ADRES
#define ADRES ADRES
extern volatile unsigned char           ADRES               __at(0x008);
#ifndef _LIB_BUILD
asm("ADRES equ 08h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES                  :8;
    };
    struct {
        unsigned ADRES0                 :1;
        unsigned ADRES1                 :1;
        unsigned ADRES2                 :1;
        unsigned ADRES3                 :1;
        unsigned ADRES4                 :1;
        unsigned ADRES5                 :1;
        unsigned ADRES6                 :1;
        unsigned ADRES7                 :1;
    };
} ADRESbits_t;
extern volatile ADRESbits_t ADRESbits __at(0x008);
// bitfield macros
#define _ADRES_ADRES_POSN                                   0x0
#define _ADRES_ADRES_POSITION                               0x0
#define _ADRES_ADRES_SIZE                                   0x8
#define _ADRES_ADRES_LENGTH                                 0x8
#define _ADRES_ADRES_MASK                                   0xFF
#define _ADRES_ADRES0_POSN                                  0x0
#define _ADRES_ADRES0_POSITION                              0x0
#define _ADRES_ADRES0_SIZE                                  0x1
#define _ADRES_ADRES0_LENGTH                                0x1
#define _ADRES_ADRES0_MASK                                  0x1
#define _ADRES_ADRES1_POSN                                  0x1
#define _ADRES_ADRES1_POSITION                              0x1
#define _ADRES_ADRES1_SIZE                                  0x1
#define _ADRES_ADRES1_LENGTH                                0x1
#define _ADRES_ADRES1_MASK                                  0x2
#define _ADRES_ADRES2_POSN                                  0x2
#define _ADRES_ADRES2_POSITION                              0x2
#define _ADRES_ADRES2_SIZE                                  0x1
#define _ADRES_ADRES2_LENGTH                                0x1
#define _ADRES_ADRES2_MASK                                  0x4
#define _ADRES_ADRES3_POSN                                  0x3
#define _ADRES_ADRES3_POSITION                              0x3
#define _ADRES_ADRES3_SIZE                                  0x1
#define _ADRES_ADRES3_LENGTH                                0x1
#define _ADRES_ADRES3_MASK                                  0x8
#define _ADRES_ADRES4_POSN                                  0x4
#define _ADRES_ADRES4_POSITION                              0x4
#define _ADRES_ADRES4_SIZE                                  0x1
#define _ADRES_ADRES4_LENGTH                                0x1
#define _ADRES_ADRES4_MASK                                  0x10
#define _ADRES_ADRES5_POSN                                  0x5
#define _ADRES_ADRES5_POSITION                              0x5
#define _ADRES_ADRES5_SIZE                                  0x1
#define _ADRES_ADRES5_LENGTH                                0x1
#define _ADRES_ADRES5_MASK                                  0x20
#define _ADRES_ADRES6_POSN                                  0x6
#define _ADRES_ADRES6_POSITION                              0x6
#define _ADRES_ADRES6_SIZE                                  0x1
#define _ADRES_ADRES6_LENGTH                                0x1
#define _ADRES_ADRES6_MASK                                  0x40
#define _ADRES_ADRES7_POSN                                  0x7
#define _ADRES_ADRES7_POSITION                              0x7
#define _ADRES_ADRES7_SIZE                                  0x1
#define _ADRES_ADRES7_LENGTH                                0x1
#define _ADRES_ADRES7_MASK                                  0x80

// Register: OPTION
#define OPTION OPTION
extern volatile __control unsigned char OPTION              __at(0x000);

// Register: TRIS
#define TRIS TRIS
extern volatile __control unsigned char TRIS                __at(0x006);

// Register: TRISGPIO
#define TRISGPIO TRISGPIO
extern volatile __control unsigned char TRISGPIO            __at(0x006);

/*
 * OPTION bits
 */
#define                                 PS                  0x7
#define                                 PSA                 0x8
#define                                 T0SE                0x10
#define                                 T0CS                0x20
#define                                 nGPPU               0x40
#define                                 nGPWU               0x80
#define                                 PS0                 0x1
#define                                 PS1                 0x2
#define                                 PS2                 0x4

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&01Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&01FFh)
#endif
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADRES<ADRES0>
extern volatile __bit                   ADRES0              __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 ADRES0_bit          _BIT_ACCESS(ADRES,0)
// ADRES<ADRES1>
extern volatile __bit                   ADRES1              __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 ADRES1_bit          _BIT_ACCESS(ADRES,1)
// ADRES<ADRES2>
extern volatile __bit                   ADRES2              __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 ADRES2_bit          _BIT_ACCESS(ADRES,2)
// ADRES<ADRES3>
extern volatile __bit                   ADRES3              __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 ADRES3_bit          _BIT_ACCESS(ADRES,3)
// ADRES<ADRES4>
extern volatile __bit                   ADRES4              __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 ADRES4_bit          _BIT_ACCESS(ADRES,4)
// ADRES<ADRES5>
extern volatile __bit                   ADRES5              __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 ADRES5_bit          _BIT_ACCESS(ADRES,5)
// ADRES<ADRES6>
extern volatile __bit                   ADRES6              __at(0x46);	// @ (0x8 * 8 + 6)
#define                                 ADRES6_bit          _BIT_ACCESS(ADRES,6)
// ADRES<ADRES7>
extern volatile __bit                   ADRES7              __at(0x47);	// @ (0x8 * 8 + 7)
#define                                 ADRES7_bit          _BIT_ACCESS(ADRES,7)
// ADCON0<ANS0>
extern volatile __bit                   ANS0                __at(0x3E);	// @ (0x7 * 8 + 6)
#define                                 ANS0_bit            _BIT_ACCESS(ADCON0,6)
// ADCON0<ANS1>
extern volatile __bit                   ANS1                __at(0x3F);	// @ (0x7 * 8 + 7)
#define                                 ANS1_bit            _BIT_ACCESS(ADCON0,7)
// OSCCAL<CAL0>
extern volatile __bit                   CAL0                __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 CAL0_bit            _BIT_ACCESS(OSCCAL,1)
// OSCCAL<CAL1>
extern volatile __bit                   CAL1                __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 CAL1_bit            _BIT_ACCESS(OSCCAL,2)
// OSCCAL<CAL2>
extern volatile __bit                   CAL2                __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 CAL2_bit            _BIT_ACCESS(OSCCAL,3)
// OSCCAL<CAL3>
extern volatile __bit                   CAL3                __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 CAL3_bit            _BIT_ACCESS(OSCCAL,4)
// OSCCAL<CAL4>
extern volatile __bit                   CAL4                __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 CAL4_bit            _BIT_ACCESS(OSCCAL,5)
// OSCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 CAL5_bit            _BIT_ACCESS(OSCCAL,6)
// OSCCAL<CAL6>
extern volatile __bit                   CAL6                __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 CAL6_bit            _BIT_ACCESS(OSCCAL,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// OSCCAL<FOSC4>
extern volatile __bit                   FOSC4               __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 FOSC4_bit           _BIT_ACCESS(OSCCAL,0)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// GPIO<GP0>
extern volatile __bit                   GP0                 __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 GP0_bit             _BIT_ACCESS(GPIO,0)
// GPIO<GP1>
extern volatile __bit                   GP1                 __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 GP1_bit             _BIT_ACCESS(GPIO,1)
// GPIO<GP2>
extern volatile __bit                   GP2                 __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 GP2_bit             _BIT_ACCESS(GPIO,2)
// GPIO<GP3>
extern volatile __bit                   GP3                 __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 GP3_bit             _BIT_ACCESS(GPIO,3)
// STATUS<GPWUF>
extern volatile __bit                   GPWUF               __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 GPWUF_bit           _BIT_ACCESS(STATUS,7)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,1)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x1B);	// @ (0x3 * 8 + 3)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,3)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x1C);	// @ (0x3 * 8 + 4)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,4)

#endif // _PIC10F222_H_
